<<<<<<< HEAD
a = int(input('Введите a: '))
b = int(input('Введите b: '))
c = int(input('Введите c: '))
if a==0:
    print('Нет решений')
elif (a*b==c and c==-b/a):
    print('Заданные числа обладают свойствами')
else:
    print('Заданные числа не обладают свойствами')
=======
a = int(input('Введите a: '))
b = int(input('Введите b: '))
c = int(input('Введите c: '))
if a==0:
    print('Нет решений')
elif (a*b==c and c==-b/a):
    print('Заданные числа обладают свойствами')
else:
    print('Заданные числа не обладают свойствами')
>>>>>>> 6e66c5729073ff2d66a7301e75e593e6a5c36c45
